Ran Plan for dir: `live` workspace: `default`

<details><summary>Show Output</summary>

```diff
time=2023-02-20T17:16:07Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc

Group 2
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/compute-instance
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/compute-instance


time=2023-02-20T17:16:08Z level=warning msg=Could not encode version for local source error=lstat /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc/.terragrunt-cache/dmJtZiluG9k3x7xH9EPu8ls1eBQ/KnZvmMLS1s_c3N3zvGqAMjDJNxY/live/gcp/sandbox/project.hcl: no such file or directory prefix=[/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc] 
google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/qa-andromeda-vpc]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-qa-andromeda-vpc]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-qa-andromeda-vpc-allow-https]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-qa-andromeda-vpc]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/staging-andromeda-vpc]
google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/dev-andromeda-vpc]
google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/dev-sandbox-vpc]
google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/stg-sandbox-vpc]
google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/prod-andromeda-vpc]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-dev-andromeda-vpc-allow-https]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-dev-andromeda-vpc]
google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/prod-sandbox-vpc]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-dev-andromeda-vpc]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-staging-andromeda-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-staging-andromeda-vpc]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-staging-andromeda-vpc-allow-https]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-dev-sandbox-vpc-allow-https]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-dev-sandbox-vpc]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-dev-sandbox-vpc]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-stg-sandbox-vpc-allow-https]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-stg-sandbox-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-stg-sandbox-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc]
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-prod-andromeda-vpc-allow-https]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/andromeda-378216/global/firewalls/firewall-prod-andromeda-vpc]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
google_compute_firewall.fw_rules_https: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-prod-sandbox-vpc-allow-https]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc]
google_compute_firewall.fw_rules: Refreshing state... [id=projects/sandbox-376723/global/firewalls/firewall-prod-sandbox-vpc]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/andromeda-378216/zones/asia-southeast1-b/instances/qa-app]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-small"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "staging-app"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "projects/andromeda-378216/global/networks/staging-andromeda-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-staging-andromeda-vpc"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan"
google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-a/instances/dev-app]
google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-b/instances/stg-app]
google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app1]
google_compute_instance.vm_instance[1]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app2]
google_compute_instance.vm_instance[2]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "prod-app1"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "projects/andromeda-378216/global/networks/prod-andromeda-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[1] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "prod-app2"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "projects/andromeda-378216/global/networks/prod-andromeda-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan"
  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-small"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "dev-app"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "projects/andromeda-378216/global/networks/dev-andromeda-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-dev-andromeda-vpc"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/default.tfplan"

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-20T17:16:35Z level=info msg=
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.53.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`